package behavioral

/**
 * 참고: https://gmlwjd9405.github.io/2018/07/06/strategy-pattern.html
 *
 * 행위를 클래스로 캡슐화해 동적으로 행위를 자유롭게 바꿀 수 있게 해주는 패턴
 *      같은 문제를 해결하는 여러 알고리즘이 클래스별로 캡슐화되어 있고 이들이 필요할 때 교체할 수 있도록 함으로써 동일한 문제를 다른 알고리즘으로 해결할 수 있게 하는 디자인 패턴
 *      ‘행위(Behavioral) 패턴’의 하나 (아래 참고)
 * 즉, 전략을 쉽게 바꿀 수 있도록 해주는 디자인 패턴이다.
 *      전략이란
 *          어떤 목적을 달성하기 위해 일을 수행하는 방식, 비즈니스 규칙, 문제를 해결하는 알고리즘 등
 *          특히 게임 프로그래밍에서 게임 캐릭터가 자신이 처한 상황에 따라 공격이나 행동하는 방식을 바꾸고 싶을 때 스트래티지 패턴은 매우 유용하다.
 *
 *
 * 역할이 수행하는 작업
 *  Strategy
 *      인터페이스나 추상 클래스로 외부에서 동일한 방식으로 알고리즘을 호출하는 방법을 명시
 *  ConcreteStrategy
 *      스트래티지 패턴에서 명시한 알고리즘을 실제로 구현한 클래스
 *  Context
 *      스트래티지 패턴을 이용하는 역할을 수행한다.
 *      필요에 따라 동적으로 구체적인 전략을 바꿀 수 있도록 setter 메서드(‘집약 관계’)를 제공한다.
 *
 */
class StrategyPattern {
}